iarsystems/ewarm-toshiba-example-projects/TMPM3HLB/Libraries/system_TMPM3HyB.c
/**
 *******************************************************************************
 * @file    system_TMPM3HyB.c
 * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Source File for the
 *          TOSHIBA 'TMPM3HyB' Device Series 
 * @version V1.0.0.0
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
 * Copyright(C) Toshiba Electronic Device Solutions Corporation 2022
 *******************************************************************************
 */

#include "TMPM3HyB.h"

/*-------- <<< Start of configuration section >>> ----------------------------*/
#define FC_KCR_KEYCODE      (0xA74A9D23UL)              /*!< The specific code that writes the FCKCR register. */
#define FC_ACCR_FDLC_4      (0x00000300UL)              /*!< Data Flash read clock 4clock  */
#define FC_ACCR_FDLC_5      (0x00000400UL)              /*!< Data Flash read clock 5clock  */
#define FC_ACCR_FDLC_6      (0x00000500UL)              /*!< Data Flash read clock 6clock  */
#define FC_ACCR_FCLC_1      (0x00000000UL)              /*!< Code Flash read clock 1clock  */
#define FC_ACCR_FCLC_2      (0x00000001UL)              /*!< Code Flash read clock 2clock  */
#define FC_ACCR_FCLC_3      (0x00000002UL)              /*!< Code Flash read clock 3clock  */
#define FC_ACCR_FCLC_4      (0x00000003UL)              /*!< Code Flash read clock 4clock  */
#define FC_ACCR_FCLC_5      (0x00000004UL)              /*!< Code Flash read clock 5clock  */
#define FC_ACCR_FCLC_6      (0x00000005UL)              /*!< Code Flash read clock 6clock  */
#define SYSCORECLOCK_80M    (80000000UL)                /*!< 80MHz                         */

/* Semi-Independent Watchdog Timer (SIWDT) Configuration */
#define SIWD_SETUP              (1U)                      /* 1:Disable SIWD, 0:Enable SIWD */
#define SIWDEN_Val              (0x00000000UL)            /* SIWD Disable */
#define SIWDCR_Val              (0x000000B1UL)            /* SIWD Disable code */

/* Clock Generator (CG) Configuration */
#define CLOCK_SETUP             (1U)                      /* 1:External HOSC, 0: Internal HOSC */
#define GEAR_FC_1               (0x00000000UL)
#define GEAR_FC_2               (0x00000001UL)
#define GEAR_FC_4               (0x00000002UL)
#define GEAR_FC_8               (0x00000003UL)
#define GEAR_FC_16              (0x00000004UL)
#define PRCK_FC_1               (0x00000000UL)
#define PRCK_FC_2               (0x00000100UL)
#define PRCK_FC_4               (0x00000200UL)
#define PRCK_FC_8               (0x00000300UL)
#define PRCK_FC_16              (0x00000400UL)
#define PRCK_FC_32              (0x00000500UL)
#define PRCK_FC_64              (0x00000600UL)
#define PRCK_FC_128             (0x00000700UL)
#define PRCK_FC_256             (0x00000800UL)
#define PRCK_FC_512             (0x00000900UL)

#define SYSCR_Val               (GEAR_FC_1 | PRCK_FC_1)
#define STBYCR_Val              (0x00000000UL)

#define CG_6M_MUL_6_664_FPLL    (0x001C3535UL<<8U)      /* 6MHz  ->  40MHz  fPLL = 6MHz  * 6.664    */
#define CG_8M_MUL_5_FPLL        (0x00247028UL<<8U)      /* 8MHz  ->  40MHz  fPLL = 8MHz  * 5        */
#define CG_10M_MUL_4_FPLL       (0x002EB020UL<<8U)      /* 10MHz ->  40MHz  fPLL = 10MHz * 4        */
#define CG_12M_MUL_3_328_FPLL   (0x0036FA1AUL<<8U)      /* 12MHz ->  40MHz  fPLL = 12MHz * 3.328    */
#define CG_6M_MUL_13_328_FPLL   (0x001C2535UL<<8U)      /* 6MHz  ->  80MHz  fPLL = 6MHz  * 13.328   */
#define CG_8M_MUL_10_FPLL       (0x00246028UL<<8U)      /* 8MHz  ->  80MHz  fPLL = 8MHz  * 10       */
#define CG_10M_MUL_8_FPLL       (0x002EA020UL<<8U)      /* 10MHz ->  80MHz  fPLL = 10MHz * 8        */
#define CG_12M_MUL_6_656_FPLL   (0x0036EA1AUL<<8U)      /* 12MHz ->  80MHz  fPLL = 12MHz * 6.656    */
#define CG_6M_MUL_20_FPLL       (0x001C1028UL<<8U)      /* 6MHz  ->  120MHz fPLL = 6MHz  * 20       */
#define CG_8M_MUL_15_FPLL       (0x0024501EUL<<8U)      /* 8MHz  ->  120MHz fPLL = 8MHz  * 15       */
#define CG_10M_MUL_12_FPLL      (0x002E9018UL<<8U)      /* 10MHz ->  120MHz fPLL = 10MHz * 12       */
#define CG_12M_MUL_10_FPLL      (0x0036D014UL<<8U)      /* 12MHz ->  120MHz fPLL = 12MHz * 10       */

#define CG_PLL0SEL_PLL0ON_SET                  ((uint32_t)0x00000001)
#define CG_PLL0SEL_PLL0ON_CLEAR                ((uint32_t)0xFFFFFFFE)
#define CG_PLL0SEL_PLL0SEL_SET                 ((uint32_t)0x00000002)
#define CG_PLL0SEL_PLL0SEL_CLEAR               ((uint32_t)0xFFFFFFFD)

#define CG_OSCCR_IHOSC1EN_CLEAR              ((uint32_t)0xFFFFFFFE)
#define CG_OSCCR_EOSCEN_SET                  ((uint32_t)0x00000002)
#define CG_OSCCR_OSCSEL_SET                  ((uint32_t)0x00000100)

#define CG_WUPHCR_WUON_START_SET             ((uint32_t)0x00000001)

#if (CLOCK_SETUP)
  #define CG_WUPHCR_WUCLK_SET                ((uint32_t)0x00000100)
  #define PLL0SEL_Ready          CG_12M_MUL_10_FPLL
#else
  #define CG_WUPHCR_WUCLK_SET                ((uint32_t)0x00000000)
  #define PLL0SEL_Ready          CG_10M_MUL_12_FPLL
#endif
#define PLL0SEL_Val              (PLL0SEL_Ready|0x00000003UL)
#define PLL0SEL_MASK             (0xFFFFFF00UL)

#if defined ( __CC_ARM   )      /* RealView Compiler */
extern uint32_t Load$$FLASH_CODE_RAM$$Base;
extern uint32_t Image$$FLASH_CODE_RAM$$Base;
extern uint32_t Load$$FLASH_CODE_RAM$$Length;

#elif defined ( __ICCARM__ )    /* IAR Compiler */
#pragma section = "FLASH_CODE_RAM"
#pragma section = "FLASH_CODE_ROM"
#endif

#if defined ( __CC_ARM   )      /* RealView Compiler */
#define FLASH_API_ROM           (uint32_t *)&Load$$FLASH_CODE_RAM$$Base
#define FLASH_API_RAM           (uint32_t *)&Image$$FLASH_CODE_RAM$$Base
#define SIZE_FLASH_API          (uint32_t)&Load$$FLASH_CODE_RAM$$Length



#elif defined ( __ICCARM__ )    /* IAR Compiler */
#define FLASH_API_ROM           ((uint32_t *)__section_begin("FLASH_CODE_ROM"))
#define FLASH_API_RAM           ((uint32_t *)__section_begin("FLASH_CODE_RAM"))
#define SIZE_FLASH_API          ((uint32_t)__section_size("FLASH_CODE_ROM"))

#endif



